ManageProduct.getLSShareVersion
Returns the proper Localization Services Share location for the current release.
For example, "Dev" for latest, "Ship_2_0" for 2027.2.0, etc.
Returns: The Localization Services Share version string.